BellerageHackathon/src/Catalogs/СообщенияОбмена/СообщенияОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СообщенияОбмена</name>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщения</name>
    <type>
      <types>EnumRef.ТипыСообщенийОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСообщенийОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКорреляции</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСущности</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующейПопытки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейПопытки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХэшПолезнойНагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолезнаяНагрузка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КодHTTP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

BellerageHackathon/src/Enums/СтатусыСообщенийОбмена/СтатусыСообщенийОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСообщенийОбмена</name>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>ВОбработке</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПовтора</name>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>Подтверждено</name>
  </enumValues>
  <enumValues>
    <name>Обработано</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>НеобрабатываемаяОшибка</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Catalogs/СообщенияОбмена/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
		ИдентификаторСообщения = Новый УникальныйИдентификатор;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.СтатусыСообщенийОбмена.Новое;
	КонецЕсли;

	ДатаСоздания = ТекущаяДатаСеанса();
	ДатаСледующейПопытки = ДатаСоздания;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
		ИдентификаторСообщения = Новый УникальныйИдентификатор;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Направление)
		Или Не ЗначениеЗаполнено(ТипСообщения)
		Или Не ЗначениеЗаполнено(Статус) Тогда
		ВызватьИсключение "Не заполнены направление, тип или статус сообщения.";
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ИдентификаторСущности)
		Или ПустаяСтрока(ВерсияКонтракта)
		Или ПустаяСтрока(ХэшПолезнойНагрузки) Тогда
		ВызватьИсключение "Не заполнены идентификатор сущности, версия контракта или хэш.";
	КонецЕсли;

	Если ДатаСоздания = Дата(1, 1, 1) Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;

	Если ДатаСледующейПопытки = Дата(1, 1, 1) Тогда
		ДатаСледующейПопытки = ДатаСоздания;
	КонецЕсли;

	Если ПустаяСтрока(Наименование) Тогда
		Наименование = СтрШаблон("%1, %2", ТипСообщения, ИдентификаторСообщения);
	КонецЕсли;

	ПроверитьУникальность();
	ПроверитьНеизменяемыеПоля();

КонецПроцедуры

Процедура ПроверитьУникальность()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Сообщения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СообщенияОбмена КАК Сообщения
	|ГДЕ
	|	Сообщения.Ссылка <> &Ссылка
	|	И Сообщения.ИдентификаторСообщения = &ИдентификаторСообщения";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ИдентификаторСообщения", ИдентификаторСообщения);

	Если Не Запрос.Выполнить().Пустой() Тогда
		ВызватьИсключение "Идентификатор сообщения уже используется.";
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьНеизменяемыеПоля()

	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сообщения.ИдентификаторСообщения КАК ИдентификаторСообщения,
	|	Сообщения.Направление КАК Направление,
	|	Сообщения.ТипСообщения КАК ТипСообщения,
	|	Сообщения.ИдентификаторКорреляции КАК ИдентификаторКорреляции,
	|	Сообщения.ИдентификаторСущности КАК ИдентификаторСущности,
	|	Сообщения.ВерсияКонтракта КАК ВерсияКонтракта,
	|	Сообщения.ХэшПолезнойНагрузки КАК ХэшПолезнойНагрузки
	|ИЗ
	|	Справочник.СообщенияОбмена КАК Сообщения
	|ГДЕ
	|	Сообщения.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий()
		И (Выборка.ИдентификаторСообщения <> ИдентификаторСообщения
			Или Выборка.Направление <> Направление
			Или Выборка.ТипСообщения <> ТипСообщения
			Или Выборка.ИдентификаторКорреляции <> ИдентификаторКорреляции
			Или Выборка.ИдентификаторСущности <> ИдентификаторСущности
			Или Выборка.ВерсияКонтракта <> ВерсияКонтракта
			Или Выборка.ХэшПолезнойНагрузки <> ХэшПолезнойНагрузки) Тогда
		ВызватьИсключение "Идентичность и полезную нагрузку созданного сообщения менять нельзя.";
	КонецЕсли;

КонецПроцедуры
